examples/performance/01_single_phase_nozzle/flux/hllc/constant/schedulingProperties
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      schedulingProperties;
}

schemaVersion 1;

gpuResidentPureGasOnly          true;
gpuResidentDynamicInlet         true;
gpuResidentParticleCapacity     1000000;
gpuResidentMaxFaceWalkHops      12;
gpuResidentCourantUpdateInterval 100;
gpuResidentMaxDeltaTGrowth      1.05;

gpuCsrLevel                     L0;

gpuParticleBlockThreads         128;
gpuReductionBlockThreads        128;
